In [502]:
import pandas as pd
from sqlalchemy import create_engine

In [503]:
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/Lahman_baseball")

In [504]:
#df = pd.read_sql("SELECT * FROM batting;", con=engine)
#df.head()

## 1a. Find all players in the database who played at Vanderbilt University.
d. Which Vanderbilt player earned the most money in the majors?

### pulling in the data

In [505]:
school=pd.read_sql("SELECT * FROM schools;", con=engine)
people=pd.read_sql("SELECT * FROM people;", con=engine)
college_playing=pd.read_sql("SELECT * FROM collegeplaying;", con=engine)
salaries=pd.read_sql("SELECT * FROM salaries;", con=engine)

In [506]:
merge_college_schools=pd.merge(college_playing,school,how='left',left_on=['schoolid'],right_on = ['schoolid'])
merge_college_schools

,playerid,schoolid,yearid,schoolname,schoolcity,schoolstate,schoolnick
0,aardsda01,pennst,2001,Pennsylvania State University,State College,PA,USA
1,aardsda01,rice,2002,Rice University,Houston,TX,USA
2,aardsda01,rice,2003,Rice University,Houston,TX,USA
3,abadan01,gamiddl,1992,Middle Georgia College,Cochran,GA,USA
4,abadan01,gamiddl,1993,Middle Georgia College,Cochran,GA,USA
...,...,...,...,...,...,...,...
17345,zupcibo01,oralrob,1987,Oral Roberts University,Tulsa,OK,USA
17346,zuvelpa01,stanford,1977,Stanford University,Palo Alto,CA,USA
17347,zuvelpa01,stanford,1978,Stanford University,Palo Alto,CA,USA
17348,zuvelpa01,stanford,1979,Stanford University,Palo Alto,CA,USA
17349,zuvelpa01,stanford,1980,Stanford University,Palo Alto,CA,USA

In [507]:
Vandy=merge_college_schools[merge_college_schools['schoolid'] == "vandy"]
Vandy

,playerid,schoolid,yearid,schoolname,schoolcity,schoolstate,schoolnick
232,alvarpe01,vandy,2006,Vanderbilt University,Nashville,TN,USA
233,alvarpe01,vandy,2007,Vanderbilt University,Nashville,TN,USA
234,alvarpe01,vandy,2008,Vanderbilt University,Nashville,TN,USA
895,baxtemi01,vandy,2004,Vanderbilt University,Nashville,TN,USA
896,baxtemi01,vandy,2005,Vanderbilt University,Nashville,TN,USA
...,...,...,...,...,...,...,...
16806,willimi01,vandy,1970,Vanderbilt University,Nashville,TN,USA
16807,willimi01,vandy,1971,Vanderbilt University,Nashville,TN,USA
16808,willimi01,vandy,1972,Vanderbilt University,Nashville,TN,USA
17280,zeidjo01,vandy,2006,Vanderbilt University,Nashville,TN,USA
17281,zeidjo01,vandy,2007,Vanderbilt University,Nashville,TN,USA

In [508]:
#merge with people to get player name
merge_people_Vandy = pd.merge(Vandy,people,  how='left', left_on=['playerid'], right_on = ['playerid'])
merge_people_Vandy

,playerid,schoolid,yearid,schoolname,schoolcity,schoolstate,schoolnick,birthyear,birthmonth,birthday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,alvarpe01,vandy,2006,Vanderbilt University,Nashville,TN,USA,1987.0,2.0,6.0,...,Alvarez,Pedro Manuel,250.0,75.0,L,R,2010-06-16,2016-10-01,alvap001,alvarpe01
1,alvarpe01,vandy,2007,Vanderbilt University,Nashville,TN,USA,1987.0,2.0,6.0,...,Alvarez,Pedro Manuel,250.0,75.0,L,R,2010-06-16,2016-10-01,alvap001,alvarpe01
2,alvarpe01,vandy,2008,Vanderbilt University,Nashville,TN,USA,1987.0,2.0,6.0,...,Alvarez,Pedro Manuel,250.0,75.0,L,R,2010-06-16,2016-10-01,alvap001,alvarpe01
3,baxtemi01,vandy,2004,Vanderbilt University,Nashville,TN,USA,1984.0,12.0,7.0,...,Baxter,Michael Joseph,205.0,72.0,L,R,2010-09-06,2015-07-08,baxtm001,baxtemi01
4,baxtemi01,vandy,2005,Vanderbilt University,Nashville,TN,USA,1984.0,12.0,7.0,...,Baxter,Michael Joseph,205.0,72.0,L,R,2010-09-06,2015-07-08,baxtm001,baxtemi01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
60,willimi01,vandy,1970,Vanderbilt University,Nashville,TN,USA,1950.0,12.0,26.0,...,Willis,Michael Henry,205.0,74.0,L,L,1977-04-13,1981-06-11,willm101,willimi01
61,willimi01,vandy,1971,Vanderbilt University,Nashville,TN,USA,1950.0,12.0,26.0,...,Willis,Michael Henry,205.0,74.0,L,L,1977-04-13,1981-06-11,willm101,willimi01
62,willimi01,vandy,1972,Vanderbilt University,Nashville,TN,USA,1950.0,12.0,26.0,...,Willis,Michael Henry,205.0,74.0,L,L,1977-04-13,1981-06-11,willm101,willimi01
63,zeidjo01,vandy,2006,Vanderbilt University,Nashville,TN,USA,1987.0,3.0,24.0,...,Zeid,Joshua Alexander,220.0,76.0,R,R,2013-07-30,2014-07-24,zeidj001,zeidjo01
64,zeidjo01,vandy,2007,Vanderbilt University,Nashville,TN,USA,1987.0,3.0,24.0,...,Zeid,Joshua Alexander,220.0,76.0,R,R,2013-07-30,2014-07-24,zeidj001,zeidjo01

In [509]:
Vandy=merge_people_Vandy[['namelast','namefirst']]

Vandy=Vandy.drop_duplicates()
Vandy=Vandy.set_index('namelast')
Vandy

           namefirst
namelast
Alvarez        Pedro
Baxter          Mike
Christiani      Nick
Collins       Wilson
Cora            Joey
Embry           Slim
Flaherty        Ryan
Gray           Sonny
Hendrick      Harvey
Kata            Matt
Lewis         Jensen
Madison       Scotti
Minor           Mike
Moore        Scrappy
Moss             Mal
Paul            Josh
Price          David
Prior           Mark
Richardson    Antoan
Sanderson      Scott
Sewell           Rip
Sowers        Jeremy
Willis          Mike
Zeid            Josh

### 1b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.

##### merge _people_vandy df with salaries

In [511]:
#adding playerid back in to merge with salaries
Vandy_people=merge_people_Vandy[['playerid','namelast','namefirst']]
Vandy_people=Vandy_people.drop_duplicates()
Vandy_people

     playerid    namelast namefirst
0   alvarpe01     Alvarez     Pedro
3   baxtemi01      Baxter      Mike
5   chrisni01  Christiani      Nick
9   colliwi01     Collins    Wilson
12   corajo01        Cora      Joey
15  embresl01       Embry      Slim
18  flahery01    Flaherty      Ryan
21   grayso01        Gray     Sonny
24  hendrha01    Hendrick    Harvey
25   katama01        Kata      Matt
28  lewisje01       Lewis    Jensen
31  madissc01     Madison    Scotti
35  minormi01       Minor      Mike
38  mooresc01       Moore   Scrappy
41   mossma01        Moss       Mal
44   pauljo01        Paul      Josh
47  priceda01       Price     David
50  priorma01       Prior      Mark
51  richaan01  Richardson    Antoan
53  sandesc01   Sanderson     Scott
55  sewelri01      Sewell       Rip
57  sowerje01      Sowers    Jeremy
60  willimi01      Willis      Mike
63   zeidjo01        Zeid      Josh

In [512]:
Vandy_salaries = pd.merge(Vandy_people,salaries, how='inner', left_on = ['playerid'], right_on = ['playerid'])
Vandy_salaries

     playerid   namelast namefirst  yearid teamid lgid     salary
0   alvarpe01    Alvarez     Pedro    2011    PIT   NL  2050000.0
1   alvarpe01    Alvarez     Pedro    2012    PIT   NL  2200000.0
2   alvarpe01    Alvarez     Pedro    2013    PIT   NL   700000.0
3   alvarpe01    Alvarez     Pedro    2014    PIT   NL  4250000.0
4   alvarpe01    Alvarez     Pedro    2015    PIT   NL  5750000.0
..        ...        ...       ...     ...    ...  ...        ...
69  sandesc01  Sanderson     Scott    1993    NYA   AL   250000.0
70  sandesc01  Sanderson     Scott    1994    CHA   AL   350000.0
71  sandesc01  Sanderson     Scott    1995    CAL   AL   250000.0
72  sandesc01  Sanderson     Scott    1996    CAL   AL   200000.0
73  sowerje01     Sowers    Jeremy    2007    CLE   AL   384800.0

[74 rows x 7 columns]

In [513]:
Vandy_salaries=Vandy_salaries.groupby(['playerid','namelast','namefirst']).sum()
Vandy_salaries

                                yearid      salary
playerid  namelast   namefirst
alvarpe01 Alvarez    Pedro       12081  20681704.0
baxtemi01 Baxter     Mike         8050   2094418.0
chrisni01 Christiani Nick         2014    500000.0
corajo01  Cora       Joey        19935   5622500.0
flahery01 Flaherty   Ryan        10070   4061000.0
grayso01  Gray       Sonny        6045   1542500.0
katama01  Kata       Matt         6016   1060000.0
lewisje01 Lewis      Jensen       6027   1234000.0
madissc01 Madison    Scotti       3977    135000.0
minormi01 Minor      Mike         8055   6837500.0
pauljo01  Paul       Josh        14026   2640000.0
priceda01 Price      David       14091  81851296.0
priorma01 Prior      Mark        10026  12800000.0
sandesc01 Sanderson  Scott       25879  10750000.0
sowerje01 Sowers     Jeremy       2007    384800.0

### 1c. Sort this list in descending order by the total salary earned. d. Which Vanderbilt player earned the most money in the majors?

In [514]:
## david price at Vandy_people.nlargest(1)

In [515]:
Vandy_salaries.sort_values('salary',ascending=False)

                                yearid      salary
playerid  namelast   namefirst
priceda01 Price      David       14091  81851296.0
alvarpe01 Alvarez    Pedro       12081  20681704.0
priorma01 Prior      Mark        10026  12800000.0
sandesc01 Sanderson  Scott       25879  10750000.0
minormi01 Minor      Mike         8055   6837500.0
corajo01  Cora       Joey        19935   5622500.0
flahery01 Flaherty   Ryan        10070   4061000.0
pauljo01  Paul       Josh        14026   2640000.0
baxtemi01 Baxter     Mike         8050   2094418.0
grayso01  Gray       Sonny        6045   1542500.0
lewisje01 Lewis      Jensen       6027   1234000.0
katama01  Kata       Matt         6016   1060000.0
chrisni01 Christiani Nick         2014    500000.0
sowerje01 Sowers     Jeremy       2007    384800.0
madissc01 Madison    Scotti       3977    135000.0

### 2. Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.

In [516]:
##import fielding table
fielding=pd.read_sql("SELECT * FROM fielding;", con=engine)
#fielding

In [517]:
Position=[]
for i in fielding['pos']:
    if i == 'OF':
        Position.append('Outfield')
    elif i in['SS','1B','2B','3B']:
        Position.append('Infield')
    elif i in ['P','C']:
        Position.append('Battery')
    else:
        Position.append('none')  #make sure all have a value
len(Position)

136815

In [518]:
fielding['Position'] = Position
fielding=fielding[['playerid','Position','yearid']]
fielding

         playerid  Position  yearid
0       abercda01   Infield    1871
1        addybo01   Infield    1871
2        addybo01   Infield    1871
3       allisar01   Infield    1871
4       allisar01  Outfield    1871
...           ...       ...     ...
136810  zobribe01   Infield    2016
136811  zobribe01  Outfield    2016
136812  zobribe01   Infield    2016
136813  zuninmi01   Battery    2016
136814   zychto01   Battery    2016

[136815 rows x 3 columns]

In [519]:
fielding2016=fielding[fielding['yearid'] == 2016]
fielding2016

         playerid  Position  yearid
134862   abadfe01   Battery    2016
134863   abadfe01   Battery    2016
134864  abreujo02   Infield    2016
134865  achteaj01   Battery    2016
134866  ackledu01   Infield    2016
...           ...       ...     ...
136810  zobribe01   Infield    2016
136811  zobribe01  Outfield    2016
136812  zobribe01   Infield    2016
136813  zuninmi01   Battery    2016
136814   zychto01   Battery    2016

[1953 rows x 3 columns]

In [520]:
fielding2016.drop(labels=['yearid','playerid'],axis=1,inplace=True)
fielding2016

C:\Users\dhoza\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

        Position
134862   Battery
134863   Battery
134864   Infield
134865   Battery
134866   Infield
...          ...
136810   Infield
136811  Outfield
136812   Infield
136813   Battery
136814   Battery

[1953 rows x 1 columns]

In [521]:
fielding2016.groupby(['Position']).size()

Position
Battery     938
Infield     661
Outfield    354
dtype: int64

In [522]:
fielding2016.groupby(['Position'])['Position'].count()

Position
Battery     938
Infield     661
Outfield    354
Name: Position, dtype: int64